
## Terraform plan for environment: `dev`

**Commit:** 20fcc9ed1b14f3f9eeaba0204e4bd5a3e6a3d4f4


**API version:** 988f85a
**Selfserve version:** 988f85a
**Internal version:** 988f85a

### Plan summary

`3 to add, 0 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.module.batch.aws_batch_compute_environment.this["a_fargate"]
module.service.module.batch.aws_batch_job_queue.this["high_priority"]
module.service.module.batch.aws_batch_job_queue.this["low_priority"]
```
**🗑️ Deletes**

```tf
module.service.module.batch.aws_batch_job_definition.this["job_configuration"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_compute_environment.this["a_fargate"] will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "batch-app-fargate-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = "arn:aws:iam::054614622558:role/batch/dev-batch-app-batch-role-20240705091350939600000001"
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                            = "MANAGED"

      + compute_resources {
          + desired_vcpus      = (known after apply)
          + max_vcpus          = 4
          + security_group_ids = [
              + "sg-c5b527a1",
            ]
          + subnets            = [
              + "subnet-0516482542b236301",
              + "subnet-05933d7aef9cd4195",
              + "subnet-085356c74213846bd",
            ]
          + type               = "FARGATE"

          + ec2_configuration (known after apply)
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["job_configuration"] will be destroyed
  # (because key ["job_configuration"] is not in for_each map)
  - resource "aws_batch_job_definition" "this" {
      - arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/processQueue-job:1" -> null
      - arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/processQueue-job" -> null
      - container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas --container=/var/www/html/config/container-cli.php",
                  - "queue:process-queue",
                ]
              - environment                  = []
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:latest"
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> null
      - deregister_on_new_revision = true -> null
      - id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/processQueue-job:1" -> null
      - name                       = "processQueue-job" -> null
      - parameters                 = {} -> null
      - platform_capabilities      = [
          - "FARGATE",
        ] -> null
      - propagate_tags             = true -> null
      - revision                   = 1 -> null
      - scheduling_priority        = 0 -> null
      - tags                       = {
          - "JobDefinition" = "BatchTest"
        } -> null
      - tags_all                   = {
          - "Environment"   = "dev"
          - "JobDefinition" = "BatchTest"
          - "Repository"    = "https://github.com/dvsa/vol-app"
        } -> null
      - type                       = "container" -> null
        # (1 unchanged attribute hidden)

      - retry_strategy {
          - attempts = 3 -> null

          - evaluate_on_exit {
              - action           = "exit" -> null
              - on_exit_code     = "0" -> null
                # (2 unchanged attributes hidden)
            }
          - evaluate_on_exit {
              - action           = "retry" -> null
              - on_exit_code     = "1" -> null
                # (2 unchanged attributes hidden)
            }
        }

      - timeout {
          - attempt_duration_seconds = 60 -> null
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["high_priority"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "BatchTestHighPriorityFargate"
      + priority              = 99
      + scheduling_policy_arn = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestHighPriorityFargate"
      + state                 = "ENABLED"
      + tags                  = {
          + "JobQueue" = "High priority job queue"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "JobQueue"    = "High priority job queue"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["low_priority"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "BatchTestLowPriorityFargate"
      + priority              = 1
      + scheduling_policy_arn = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestLowPriorityFargate"
      + state                 = "ENABLED"
      + tags                  = {
          + "JobQueue" = "Low priority job queue"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "JobQueue"    = "Low priority job queue"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

```

</details>